Revit 2016 API
UIDocument Constructor
 Use a database level Document to construct a UI-level Document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public UIDocument(
	Document document
)
Visual Basic
Public Sub New ( _
	document As Document _
)
Visual C++
public:
UIDocument(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
See Also
UIDocument Class
Autodesk.Revit.UI Namespace